&НаКлиенте
Процедура КлиентыПриАктивизацииСтроки(Элемент)
	ТекущийКлиент = Элементы.Клиенты.ТекущиеДанные.Ссылка;
	Хранилища.Параметры.УстановитьЗначениеПараметра("Владелец", ТекущийКлиент);
	УстановитьОтборПоКлиенту();
	ХранилищаПриАктивизацииСтроки(Элементы.Хранилища);
КонецПроцедуры

&НаСервере
Процедура УстановитьОтборПоКлиенту()
	НЗ = РеквизитФормыВЗначение("Доработки");
	НЗ.Отбор.Клиент.Использование = Истина;
	НЗ.Отбор.Клиент.Значение = ТекущийКлиент;
	НЗ.Прочитать();
	ТекущиеОбъекты.ЗагрузитьЗначения(НЗ.Выгрузить().ВыгрузитьКолонку("ОбъектКонфы"));
	ЗначениеВРеквизитФормы(НЗ, "Доработки");
КонецПроцедуры

&НаКлиенте
Процедура ДоработкиПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	ЗаписатьИзмененияНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаписатьИзмененияНаСервере()
	НЗ = РеквизитФормыВЗначение("Доработки");
	НЗ.Записать();
КонецПроцедуры

&НаКлиенте
Процедура ДоработкиПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	Если Не ЗначениеЗаполнено(Элемент.ТекущиеДанные.Клиент) Тогда
		Элемент.ТекущиеДанные.Клиент = ТекущийКлиент;
	КонецЕсли;
	Если НоваяСтрока Тогда
		Элемент.ТекущиеДанные.Пользователь = ТекущийПользователь;
		Элемент.ТекущиеДанные.ДатаИзменений = ТекущаяДата();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ТекущийПользователь = ПараметрыСеанса.ТекущийПользователь;
КонецПроцедуры

&НаКлиенте
Процедура ДоработкиПослеУдаления(Элемент)
	ЗаписатьИзмененияНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ХранилищаПриАктивизацииСтроки(Элемент)
	Если Элементы.Хранилища.ТекущиеДанные = Неопределено Тогда
		ТекущееХранилище = ПредопределенноеЗначение("Справочник.Хранилища.ПустаяСсылка");
	Иначе
		ТекущееХранилище = Элементы.Хранилища.ТекущиеДанные.Ссылка;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ДоработкиОбъектКонфыИзменениеТекстаРедактирования(Элемент, Текст, СтандартнаяОбработка)
	НайденныйТекст.Очистить();
	Для Сч = -(ТекущиеОбъекты.Количество() - 1) По 0 Цикл
		Если СтрНайти(ТекущиеОбъекты[-Сч].Значение,Текст) > 0 Тогда
			НайденныйТекст.Добавить(ТекущиеОбъекты[-Сч].Значение);
		КонецЕсли;	
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ДоработкиОбъектКонфыАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Если НайденныйТекст.Количество() > 0 Тогда
		ДанныеВыбора = НайденныйТекст.Скопировать();
	КонецЕсли;	
КонецПроцедуры

