
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Хранилища.Параметры.УстановитьЗначениеПараметра("Владелец",Объект.Ссылка);
КонецПроцедуры

&НаКлиенте
Процедура ХранилищаПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
	Если Объект.Ссылка.Пустая() Тогда
		ПоказатьПредупреждение(,"Сперва необходимо записать нового клиента.");
		Возврат;
	КонецЕсли;	
	ДопПараметры = Новый Структура;
	ДопПараметры.Вставить("ВладелецХранилища",Объект.Ссылка);
	Форма = ПолучитьФорму("Справочник.Хранилища.ФормаОбъекта",ДопПараметры,Объект.Ссылка);
	Форма.Открыть();
КонецПроцедуры
